###################################################################

# Created by write_sdc on Mon Dec 14 23:18:18 2020

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports clk]
set_driving_cell -lib_cell INVX1TS [get_ports rstn]
set_driving_cell -lib_cell INVX1TS [get_ports {din[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {addr[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {addr[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {addr[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {addr[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {addr[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {addr[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {addr[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {addr[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {addr[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {addr[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {addr[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {addr[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {addr[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {addr[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports dload]
set_driving_cell -lib_cell INVX1TS [get_ports cload]
set_driving_cell -lib_cell INVX1TS [get_ports s]
set_load -pin_load 1 [get_ports {dout[15]}]
set_load -pin_load 1 [get_ports {dout[14]}]
set_load -pin_load 1 [get_ports {dout[13]}]
set_load -pin_load 1 [get_ports {dout[12]}]
set_load -pin_load 1 [get_ports {dout[11]}]
set_load -pin_load 1 [get_ports {dout[10]}]
set_load -pin_load 1 [get_ports {dout[9]}]
set_load -pin_load 1 [get_ports {dout[8]}]
set_load -pin_load 1 [get_ports {dout[7]}]
set_load -pin_load 1 [get_ports {dout[6]}]
set_load -pin_load 1 [get_ports {dout[5]}]
set_load -pin_load 1 [get_ports {dout[4]}]
set_load -pin_load 1 [get_ports {dout[3]}]
set_load -pin_load 1 [get_ports {dout[2]}]
set_load -pin_load 1 [get_ports {dout[1]}]
set_load -pin_load 1 [get_ports {dout[0]}]
set_load -pin_load 1 [get_ports valid]
set_load -pin_load 1 [get_ports Done]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports rstn]
set_max_capacitance 0.005 [get_ports {din[15]}]
set_max_capacitance 0.005 [get_ports {din[14]}]
set_max_capacitance 0.005 [get_ports {din[13]}]
set_max_capacitance 0.005 [get_ports {din[12]}]
set_max_capacitance 0.005 [get_ports {din[11]}]
set_max_capacitance 0.005 [get_ports {din[10]}]
set_max_capacitance 0.005 [get_ports {din[9]}]
set_max_capacitance 0.005 [get_ports {din[8]}]
set_max_capacitance 0.005 [get_ports {din[7]}]
set_max_capacitance 0.005 [get_ports {din[6]}]
set_max_capacitance 0.005 [get_ports {din[5]}]
set_max_capacitance 0.005 [get_ports {din[4]}]
set_max_capacitance 0.005 [get_ports {din[3]}]
set_max_capacitance 0.005 [get_ports {din[2]}]
set_max_capacitance 0.005 [get_ports {din[1]}]
set_max_capacitance 0.005 [get_ports {din[0]}]
set_max_capacitance 0.005 [get_ports {addr[13]}]
set_max_capacitance 0.005 [get_ports {addr[12]}]
set_max_capacitance 0.005 [get_ports {addr[11]}]
set_max_capacitance 0.005 [get_ports {addr[10]}]
set_max_capacitance 0.005 [get_ports {addr[9]}]
set_max_capacitance 0.005 [get_ports {addr[8]}]
set_max_capacitance 0.005 [get_ports {addr[7]}]
set_max_capacitance 0.005 [get_ports {addr[6]}]
set_max_capacitance 0.005 [get_ports {addr[5]}]
set_max_capacitance 0.005 [get_ports {addr[4]}]
set_max_capacitance 0.005 [get_ports {addr[3]}]
set_max_capacitance 0.005 [get_ports {addr[2]}]
set_max_capacitance 0.005 [get_ports {addr[1]}]
set_max_capacitance 0.005 [get_ports {addr[0]}]
set_max_capacitance 0.005 [get_ports dload]
set_max_capacitance 0.005 [get_ports cload]
set_max_capacitance 0.005 [get_ports s]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports rstn]
set_max_fanout 4 [get_ports {din[15]}]
set_max_fanout 4 [get_ports {din[14]}]
set_max_fanout 4 [get_ports {din[13]}]
set_max_fanout 4 [get_ports {din[12]}]
set_max_fanout 4 [get_ports {din[11]}]
set_max_fanout 4 [get_ports {din[10]}]
set_max_fanout 4 [get_ports {din[9]}]
set_max_fanout 4 [get_ports {din[8]}]
set_max_fanout 4 [get_ports {din[7]}]
set_max_fanout 4 [get_ports {din[6]}]
set_max_fanout 4 [get_ports {din[5]}]
set_max_fanout 4 [get_ports {din[4]}]
set_max_fanout 4 [get_ports {din[3]}]
set_max_fanout 4 [get_ports {din[2]}]
set_max_fanout 4 [get_ports {din[1]}]
set_max_fanout 4 [get_ports {din[0]}]
set_max_fanout 4 [get_ports {addr[13]}]
set_max_fanout 4 [get_ports {addr[12]}]
set_max_fanout 4 [get_ports {addr[11]}]
set_max_fanout 4 [get_ports {addr[10]}]
set_max_fanout 4 [get_ports {addr[9]}]
set_max_fanout 4 [get_ports {addr[8]}]
set_max_fanout 4 [get_ports {addr[7]}]
set_max_fanout 4 [get_ports {addr[6]}]
set_max_fanout 4 [get_ports {addr[5]}]
set_max_fanout 4 [get_ports {addr[4]}]
set_max_fanout 4 [get_ports {addr[3]}]
set_max_fanout 4 [get_ports {addr[2]}]
set_max_fanout 4 [get_ports {addr[1]}]
set_max_fanout 4 [get_ports {addr[0]}]
set_max_fanout 4 [get_ports dload]
set_max_fanout 4 [get_ports cload]
set_max_fanout 4 [get_ports s]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_uncertainty 0  [get_clocks clk]
set_clock_transition -max -rise 0.01 [get_clocks clk]
set_clock_transition -max -fall 0.01 [get_clocks clk]
set_clock_transition -min -rise 0.01 [get_clocks clk]
set_clock_transition -min -fall 0.01 [get_clocks clk]
set_input_delay -clock clk  0.05  [get_ports rstn]
set_input_delay -clock clk  0.05  [get_ports {din[15]}]
set_input_delay -clock clk  0.05  [get_ports {din[14]}]
set_input_delay -clock clk  0.05  [get_ports {din[13]}]
set_input_delay -clock clk  0.05  [get_ports {din[12]}]
set_input_delay -clock clk  0.05  [get_ports {din[11]}]
set_input_delay -clock clk  0.05  [get_ports {din[10]}]
set_input_delay -clock clk  0.05  [get_ports {din[9]}]
set_input_delay -clock clk  0.05  [get_ports {din[8]}]
set_input_delay -clock clk  0.05  [get_ports {din[7]}]
set_input_delay -clock clk  0.05  [get_ports {din[6]}]
set_input_delay -clock clk  0.05  [get_ports {din[5]}]
set_input_delay -clock clk  0.05  [get_ports {din[4]}]
set_input_delay -clock clk  0.05  [get_ports {din[3]}]
set_input_delay -clock clk  0.05  [get_ports {din[2]}]
set_input_delay -clock clk  0.05  [get_ports {din[1]}]
set_input_delay -clock clk  0.05  [get_ports {din[0]}]
set_input_delay -clock clk  0.05  [get_ports {addr[13]}]
set_input_delay -clock clk  0.05  [get_ports {addr[12]}]
set_input_delay -clock clk  0.05  [get_ports {addr[11]}]
set_input_delay -clock clk  0.05  [get_ports {addr[10]}]
set_input_delay -clock clk  0.05  [get_ports {addr[9]}]
set_input_delay -clock clk  0.05  [get_ports {addr[8]}]
set_input_delay -clock clk  0.05  [get_ports {addr[7]}]
set_input_delay -clock clk  0.05  [get_ports {addr[6]}]
set_input_delay -clock clk  0.05  [get_ports {addr[5]}]
set_input_delay -clock clk  0.05  [get_ports {addr[4]}]
set_input_delay -clock clk  0.05  [get_ports {addr[3]}]
set_input_delay -clock clk  0.05  [get_ports {addr[2]}]
set_input_delay -clock clk  0.05  [get_ports {addr[1]}]
set_input_delay -clock clk  0.05  [get_ports {addr[0]}]
set_input_delay -clock clk  0.05  [get_ports dload]
set_input_delay -clock clk  0.05  [get_ports cload]
set_input_delay -clock clk  0.05  [get_ports s]
set_output_delay -clock clk  0.05  [get_ports {dout[15]}]
set_output_delay -clock clk  0.05  [get_ports {dout[14]}]
set_output_delay -clock clk  0.05  [get_ports {dout[13]}]
set_output_delay -clock clk  0.05  [get_ports {dout[12]}]
set_output_delay -clock clk  0.05  [get_ports {dout[11]}]
set_output_delay -clock clk  0.05  [get_ports {dout[10]}]
set_output_delay -clock clk  0.05  [get_ports {dout[9]}]
set_output_delay -clock clk  0.05  [get_ports {dout[8]}]
set_output_delay -clock clk  0.05  [get_ports {dout[7]}]
set_output_delay -clock clk  0.05  [get_ports {dout[6]}]
set_output_delay -clock clk  0.05  [get_ports {dout[5]}]
set_output_delay -clock clk  0.05  [get_ports {dout[4]}]
set_output_delay -clock clk  0.05  [get_ports {dout[3]}]
set_output_delay -clock clk  0.05  [get_ports {dout[2]}]
set_output_delay -clock clk  0.05  [get_ports {dout[1]}]
set_output_delay -clock clk  0.05  [get_ports {dout[0]}]
set_output_delay -clock clk  0.05  [get_ports valid]
set_output_delay -clock clk  0.05  [get_ports Done]
